/*********************************************************************
 *** 版 本 号: V2.0
 *** 程序作者: zhang hailu
 *** 生成日期: 2012-9-17
 *** 所属模块: 获取队列key 值
 *** 程序名称: 
 *** 程序作用:
 *** 函数列表:
 *** 使用注意:
 *** 修改记录:
 *** 	修改作者:
 *** 	修改时间:
 *** 	修改内容:
 ********************************************************************/
#include "pub_key.h"

int pub_key_load(const char *file, key_t *key, int num)
{
	if (key == NULL|| file == NULL|| strlen(file) == 0)
	{
		return SW_ERR;
	}

	*key = ftok(file, num);

	return 0;
}

